package com.example.timesheet;

public class REST {
    /**
     * REST - набор соглашений, как оформлять проэктировать ресурсы сервиса
     *
     * Путь\эндпоинт\ручка\ресурс - /timesheet
     *
     * 1. НЕ использовать глаголы в путях
     * /deleteTimesheet/{id} - плохо
     *
     * 2.Ресурсы должны вкладываться друг в друга
     *
     * 3. Исаольховать множественное число для ресурсов
     * вместо  /user использовать /usesrs
     *
     * 4. Слова внутри ресурса соединяются дефисом
     */
}
