package com.example.timesheet.hw;

public class HomeWork {
    /**
     *
     * 1. Переделать строки RoleName в сущность Role:
     * 1.1 Создать отдельную таблицу Role(id,name)
     * 1.2 Связать User <-> Role отношением ManyToMany
     * 2. После п.1 подправить формирование полей в MyCustomUserDetailsService
     *
     * 3. В SecurityFilterChain настроить:
     * 3.1 Стандартная форма логина
     * 3.2 страницы с проектами доступны пользователям с ролью admin(вроде уже сделано)
     * 3.2 страницы с таймшитами доступны пользователям с ролью user(вроде уже сделано)
     * 3.3 REST ресурсы доступны пользователю с ролью rest
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *
     *  4. **Связываем Project <->Employee отношением ManyToMany
     *  4.1 Т.е. на проекте может быть несколько сотрудников; один сотрудник может быть на нескольких проектах.
     */
}
