package com.example.timesheet.hw;

public class HomeWork {
    /**
     *
     * 1. Подключить сваггер к своему проекту
     * 2. Добавить описание ручек (название на русском языке плюс описание, что делают)
     *3.  ** описать параметры и возвращаемые типы данных.
     *
     * В качестве домашки прислать скриншот(ы) OpenAPI страницы(которая красивая).
     * Не нужно присылать 10+ скриншотов, достаточно тех, по которым понятно, что работа сделана
     *
     *  4. **Связываем Project <->Employee отношением ManyToMany
     *  4.1 Т.е. на проекте может быть несколько сотрудников; один сотрудник может быть на нескольких проектах.
     */
}
